src/app/serviceeligibility-core-api/app/src/main/resources/exempleFlux/carteDematerialiseV2.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:bean="http://norme.cegedimassurances.com/carteDemat/beans">
    <soap:Header/>
    <soap:Body>
        <bean:carteDematerialiseeV2Request>
            <bean:header_in>
                <bean:header_technique_in>
                    <bean:id_logiciel>id_logiciel</bean:id_logiciel>
                    <bean:version_logiciel>V1</bean:version_logiciel>
                    <!--Optional:-->
                    <bean:editeur_logiciel>Cegedim</bean:editeur_logiciel>
                    <!--Optional:-->
                    <bean:nom_logiciel>CarteDemat</bean:nom_logiciel>
                    <!--Optional:-->
                    <bean:id_session_client>id_session_client</bean:id_session_client>
                    <!--Optional:-->
                    <bean:id_session_serveur>id_dossier_serveur</bean:id_session_serveur>
                    <bean:nom_norme>PoleDigit</bean:nom_norme>
                    <bean:version_norme>V1.1</bean:version_norme>
                </bean:header_technique_in>
                <bean:header_fonctionnel_in>
                    <!--Optional:-->
                    <bean:idDossier_client>idDossier_client</bean:idDossier_client>
                    <!--Optional:-->
                    <bean:idDossier_serveur>id_dossier_serveur</bean:idDossier_serveur>
                    <bean:code_proprietaire>000000001</bean:code_proprietaire>
                    <!--Optional:-->
                    <bean:code_gestionnaire>?</bean:code_gestionnaire>
                    <!--Optional:-->
                    <bean:num_accreditation>?</bean:num_accreditation>
                    <!--Optional:-->
                    <bean:num_otp>?</bean:num_otp>
                </bean:header_fonctionnel_in>
            </bean:header_in>
            <bean:request>
                <bean:numeroAMC>0033992439</bean:numeroAMC>
                <!--Optional:-->
                <bean:nomAMC>?</bean:nomAMC>
                <bean:dateReference>2022-12-15</bean:dateReference>
                <bean:numeroContrat>F50093544</bean:numeroContrat>
            </bean:request>
        </bean:carteDematerialiseeV2Request>
    </soap:Body>
</soap:Envelope>
